In [15]:
import pandas as pd

In [5]:
data_list = [
    23, 451, 98, 312, 76, 219, "apple", 182, 400, 95, 210,
    37, 190, 475, "banana", 275, 318, 290, 365, 490, 132,
    267, "grape", 345, 201, 499, 78, 215, 370, "cherry",
    405, 123, 287, 450, 398, 176, 329, 288, 190, 209,
    "mango", 255, 300, 410, 126, 497, 372, 213, 65, "peach",
    435, 385, 278, 490, 155, 420, 370, 132, 390, "kiwi",
    415, 112, 240, 321, 480, 170, 270, "pear", 335, 310,
    455, 101, 375, 295, 310, 428, 178, 130, 199,
    "strawberry", 250, 340, 408, 275, 140, 306, 357, 195,
    310, "plum", 410, 375, 198, 220, 314, "4", "8+", "9%"
]

In [6]:
cleaned_data  = [item for item in data_list if isinstance(item, int)]
print(cleaned_data)

[23, 451, 98, 312, 76, 219, 182, 400, 95, 210, 37, 190, 475, 275, 318, 290, 365, 490, 132, 267, 345, 201, 499, 78, 215, 370, 405, 123, 287, 450, 398, 176, 329, 288, 190, 209, 255, 300, 410, 126, 497, 372, 213, 65, 435, 385, 278, 490, 155, 420, 370, 132, 390, 415, 112, 240, 321, 480, 170, 270, 335, 310, 455, 101, 375, 295, 310, 428, 178, 130, 199, 250, 340, 408, 275, 140, 306, 357, 195, 310, 410, 375, 198, 220, 314]

In [12]:
clean_Data = []
for x in data_list:
    if isinstance(x, int):
        clean_Data.append(x)
    else:
        clean_Data.append(0)
print(clean_Data)

[23, 451, 98, 312, 76, 219, 0, 182, 400, 95, 210, 37, 190, 475, 0, 275, 318, 290, 365, 490, 132, 267, 0, 345, 201, 499, 78, 215, 370, 0, 405, 123, 287, 450, 398, 176, 329, 288, 190, 209, 0, 255, 300, 410, 126, 497, 372, 213, 65, 0, 435, 385, 278, 490, 155, 420, 370, 132, 390, 0, 415, 112, 240, 321, 480, 170, 270, 0, 335, 310, 455, 101, 375, 295, 310, 428, 178, 130, 199, 0, 250, 340, 408, 275, 140, 306, 357, 195, 310, 0, 410, 375, 198, 220, 314, 0, 0, 0]

In [14]:
data = {
     'Name': ['Alice', 'Bob', 'Charlie', 'David'], 
     'Age': [24, 27, 22, 32], 
     'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'] 
     }

In [17]:
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston